MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4K2FYADUG/mcu.h
/**
 *******************************************************************************
 * @file    TMPM4K2B.h
 * @brief   CMSIS Cortex-M4 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM4K2B' Device Series
 * @version V1.1.0.0
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
 * 
  * Copyright(C) Toshiba Electronic Device Solutions Corporation 2025
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TXZplus_MICROCONTROLLER
  * @{
  */
  
/** @addtogroup TMPM4K2B
  * @{
  */

#ifndef __TMPM4K2B_H__
#define __TMPM4K2B_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M4 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M4 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M4 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M4 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M4 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M4 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M4 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M4 System Tick Interrupt                          */

/******  TMPM4K2B Specific Interrupt Numbers *******************************************************************/
  INT00_IRQn                    = 0,         /*!< Interrupt pin 00a/00b                                       */
  INT01_IRQn                    = 1,         /*!< Interrupt pin 01a/01b                                       */
  INT02_IRQn                    = 2,         /*!< Interrupt pin 02a/02b                                       */
  INT03_IRQn                    = 3,         /*!< Interrupt pin 03a/03b                                       */
  INT04_IRQn                    = 4,         /*!< Interrupt pin 04                                            */
  INT05_IRQn                    = 5,         /*!< Interrupt pin 05                                            */
  INT06_IRQn                    = 6,         /*!< Interrupt pin 06                                            */
  INT07_IRQn                    = 7,         /*!< Interrupt pin 07a/07b                                       */
  INT08_IRQn                    = 8,         /*!< Interrupt pin 08                                            */
  INT09_IRQn                    = 9,         /*!< Interrupt pin 09                                            */
  INTEMG0_IRQn                  = 13,        /*!< A-PMD ch0 EMG interrupt                                     */
  INTEMG1_IRQn                  = 14,        /*!< A-PMD ch1 EMG interrupt                                     */
  INTOVV0_IRQn                  = 15,        /*!< A-PMD ch0 OVV interrupt                                     */
  INTOVV1_IRQn                  = 16,        /*!< A-PMD ch1 OVV interrupt                                     */
  INTPWM0_IRQn                  = 17,        /*!< A-PMD ch0 PWM interrupt                                     */
  INTPWM1_IRQn                  = 18,        /*!< A-PMD ch1 PWM interrupt                                     */
  INTENC00_IRQn                 = 19,        /*!< A-ENC32 ch0 Encoder input interrupt 0                       */
  INTENC01_IRQn                 = 20,        /*!< A-ENC32 ch0 Encoder input interrupt 1                       */
  INTADAPDA_IRQn                = 21,        /*!< ADC unit A PMD trigger interrupt A                          */
  INTADAPDB_IRQn                = 22,        /*!< ADC unit A PMD trigger interrupt B                          */
  INTADACP0_IRQn                = 26,        /*!< ADC unit A Monitor function 0 interrupt                     */
  INTADACP1_IRQn                = 27,        /*!< ADC unit A Monitor function 1 interrupt                     */
  INTADATRG_IRQn                = 28,        /*!< ADC unit A General-purpose trigger interrupt                */
  INTADASGL_IRQn                = 29,        /*!< ADC unit A Single conversion interrupt                      */
  INTADACNT_IRQn                = 30,        /*!< ADC unit A Continuous conversion interrupt                  */
  INTSC0RX_IRQn                 = 31,        /*!< TSPI ch0 Receive interrupt/UART ch0 Reception interrupt     */
  INTSC0TX_IRQn                 = 32,        /*!< TSPI ch0 Transmit interrupt/UART ch0 Transmission interrupt */
  INTSC0ERR_IRQn                = 33,        /*!< TSPI ch0 Error interrupt/UART ch0 Error interrupt           */
  INTSC1RX_IRQn                 = 34,        /*!< TSPI ch1 Receive interrupt/UART ch1 Reception interrupt     */
  INTSC1TX_IRQn                 = 35,        /*!< TSPI ch1 Transmit interrupt/UART ch1 Transmission interrupt */
  INTSC1ERR_IRQn                = 36,        /*!< TSPI ch1 Error interrupt/UART ch1 Error interrupt           */
  INTSC2RX_IRQn                 = 37,        /*!< TSPI ch2 Receive interrupt/UART ch2 Reception interrupt     */
  INTSC2TX_IRQn                 = 38,        /*!< TSPI ch2 Transmit interrupt/UART ch2 Transmission interrupt */
  INTSC2ERR_IRQn                = 39,        /*!< TSPI ch2 Error interrupt/UART ch2 Error interrupt           */
  INTI2C0NST_IRQn               = 43,        /*!< I2C ch0 interrupt /EI2C ch0 status interrupt                */
  INTI2C0ATX_IRQn               = 44,        /*!< I2C ch0 arbitration lost detection interrupt/EI2C ch0 transmit buffer empty interrupt*/
  INTI2C0BRX_IRQn               = 45,        /*!< I2C ch0 bus free detection interrupt/EI2C ch0 receive buffer full interrupt*/
  INTI2C0NA_IRQn                = 46,        /*!< I2C ch0 I2C NACK detection interrupt                        */
  INTT32A00AC_IRQn              = 47,        /*!< T32A ch0 timer A/C match, overflow, and underflow           */
  INTT32A00ACCAP0_IRQn          = 48,        /*!< T32A ch0 timer A/C capture 0                                */
  INTT32A00ACCAP1_IRQn          = 49,        /*!< T32A ch0 timer A/C capture 1                                */
  INTT32A00B_IRQn               = 50,        /*!< T32A ch0 timer B match, overflow, and underflow             */
  INTT32A00BCAP0_IRQn           = 51,        /*!< T32A ch0 timer B capture 0                                  */
  INTT32A00BCAP1_IRQn           = 52,        /*!< T32A ch0 timer B capture 1                                  */
  INTT32A01AC_IRQn              = 53,        /*!< T32A ch1 timer A/C match, overflow, and underflow           */
  INTT32A01ACCAP0_IRQn          = 54,        /*!< T32A ch1 timer A/C capture 0                                */
  INTT32A01ACCAP1_IRQn          = 55,        /*!< T32A ch1 timer A/C capture 1                                */
  INTT32A01B_IRQn               = 56,        /*!< T32A ch1 timer B match, overflow, and underflow             */
  INTT32A01BCAP0_IRQn           = 57,        /*!< T32A ch1 timer B capture 0                                  */
  INTT32A01BCAP1_IRQn           = 58,        /*!< T32A ch1 timer B capture 1                                  */
  INTT32A02AC_IRQn              = 59,        /*!< T32A ch2 timer A/C match, overflow, and underflow           */
  INTT32A02ACCAP0_IRQn          = 60,        /*!< T32A ch2 timer A/C capture 0                                */
  INTT32A02ACCAP1_IRQn          = 61,        /*!< T32A ch2 timer A/C capture 1                                */
  INTT32A02B_IRQn               = 62,        /*!< T32A ch2 timer B match, overflow, and underflow             */
  INTT32A02BCAP0_IRQn           = 63,        /*!< T32A ch2 timer B capture 0                                  */
  INTT32A02BCAP1_IRQn           = 64,        /*!< T32A ch2 timer B capture 1                                  */
  INTT32A03AC_IRQn              = 65,        /*!< T32A ch3 timer A/C match, overflow, and underflow           */
  INTT32A03ACCAP0_IRQn          = 66,        /*!< T32A ch3 timer A/C capture 0                                */
  INTT32A03ACCAP1_IRQn          = 67,        /*!< T32A ch3 timer A/C capture 1                                */
  INTT32A03B_IRQn               = 68,        /*!< T32A ch3 timer B match, overflow, and underflow             */
  INTT32A03BCAP0_IRQn           = 69,        /*!< T32A ch3 timer B capture 0                                  */
  INTT32A03BCAP1_IRQn           = 70,        /*!< T32A ch3 timer B capture 1                                  */
  INTT32A04AC_IRQn              = 71,        /*!< T32A ch4 timer A/C match, overflow, and underflow           */
  INTT32A04ACCAP0_IRQn          = 72,        /*!< T32A ch4 timer A/C capture 0                                */
  INTT32A04ACCAP1_IRQn          = 73,        /*!< T32A ch4 timer A/C capture 1                                */
  INTT32A04B_IRQn               = 74,        /*!< T32A ch4 timer B match, overflow, and underflow             */
  INTT32A04BCAP0_IRQn           = 75,        /*!< T32A ch4 timer B capture 0                                  */
  INTT32A04BCAP1_IRQn           = 76,        /*!< T32A ch4 timer B capture 1                                  */
  INTT32A05AC_IRQn              = 77,        /*!< T32A ch5 timer A/C match, overflow, and underflow           */
  INTT32A05ACCAP0_IRQn          = 78,        /*!< T32A ch5 timer A/C capture 0                                */
  INTT32A05ACCAP1_IRQn          = 79,        /*!< T32A ch5 timer A/C capture 1                                */
  INTT32A05B_IRQn               = 80,        /*!< T32A ch5 timer B match, overflow, and underflow             */
  INTT32A05BCAP0_IRQn           = 81,        /*!< T32A ch5 timer B capture 0                                  */
  INTT32A05BCAP1_IRQn           = 82,        /*!< T32A ch5 timer B capture 1                                  */
  INTPARI_IRQn                  = 83,        /*!< RAMP RAM Parity interrupt                                   */
  INTDMAATC_IRQn                = 84,        /*!< DMAC unit A transmission end interrupt (ch0 to 31)          */
  INTDMAAERR_IRQn               = 85,        /*!< DMAC unit A transmission error interrupt (ch0 to 31)        */
  INTFLCRDY_IRQn                = 87,        /*!< Code FLASH Ready interrupt                                  */
  INTENC10_IRQn                 = 89,        /*!< A-ENC32 ch1 Encoder input interrupt 0                       */
  INTENC11_IRQn                 = 90,        /*!< A-ENC32 ch1 Encoder input interrupt 1                       */
  INTADBPDA_IRQn                = 91,        /*!< ADC unit B PMD trigger interrupt A                          */
  INTADBPDB_IRQn                = 92,        /*!< ADC unit B PMD trigger interrupt B                          */
  INTADBCP0_IRQn                = 93,        /*!< ADC unit B Monitor function 0 interrupt                     */
  INTADBCP1_IRQn                = 94,        /*!< ADC unit B Monitor function 1 interrupt                     */
  INTADBTRG_IRQn                = 95,        /*!< ADC unit B General-purpose trigger interrupt                */
  INTADBSGL_IRQn                = 96,        /*!< ADC unit B Single conversion interrupt                      */
  INTADBCNT_IRQn                = 97,        /*!< ADC unit B Continuous conversion interrupt                  */
  INTADCCMP_IRQn                = 98         /*!< ADC Conversion result compare interrupt                     */
} IRQn_Type;

